
&НаКлиенте
Процедура ФайлНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	РежимДиалога = РежимДиалогаВыбораФайла.Открытие;
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалога);
	Если ДиалогОткрытияФайла.Выбрать() Тогда
	
		Объект.Файл = ДиалогОткрытияФайла.ПолноеИмяФайла;
	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДерево()

	Текст = Новый ТекстовыйДокумент;
	Текст.Прочитать(Объект.Файл);
	
	ОбщаяОбработка = Обработки.Общая.Создать();
	ДЗ = Новый ДеревоЗначений;
	Результат = ОбщаяОбработка.ТекстВДерево(Текст, ДЗ);
	
	
	ЗначениеВРеквизитФормы(ДЗ, "Объект.Дерево");
	
КонецПроцедуры


&НаКлиенте
Процедура РазобратьВДерево(Команда)
	
	Объект.Дерево.ПолучитьЭлементы().Очистить();
	
	ТекИндекс = "";
	стр = Объект.Файл;
	тпоз = 0;

	поз = Найти(стр, "\");
	Пока поз > 0 Цикл
		тпоз = тпоз + поз;
		стр = Сред(стр, поз + 1);
		поз = Найти(стр, "\");
	КонецЦикла;
	
	поз = Найти(стр, ":");
	Если поз > 0 Тогда
		тпоз = тпоз + поз;
		ТекИндекс = Сред(Объект.Файл, тпоз + 1);
		Объект.Файл = Лев(Объект.Файл, тпоз - 1);
	КонецЕсли;
	
	
	оФайл = Новый Файл(Объект.Файл);
	Если Не оФайл.Существует() Тогда
		Сообщить("Файл """ + Объект.Файл + """ не существует!", СтатусСообщения.Важное);
		Возврат;
	КонецЕсли;
	
	ЗаполнитьДерево();	
	
	
КонецПроцедуры
