
Процедура ПередЗаписью(Отказ)
	Код = НРег(Код);
	Если ЭтоГруппа Тогда
		Попытка
			ТекКод = +Код;
		Исключение
			ТекКод = 0;
		КонецПопытки;
		
		Запрос = Новый Запрос;
		Запрос.Текст = "
		|ВЫБРАТЬ
		|	Код
		|
		|ИЗ
		|	Справочник.Классы
		|
		|ГДЕ
		|	ЭтоГруппа
		|	И Ссылка <> &Ссылка
		|
		|";
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		МаксКод = 0;
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Попытка
				ТКод = +Выборка.Код;
			Исключение
				ТКод = 0;
			КонецПопытки;
			Если ТКод > МаксКод Тогда
				МаксКод = ТКод;
			КонецЕсли;
		КонецЦикла;
		
		Если ТекКод = 0 Или ТекКод > МаксКод Тогда
			Код = Формат(МаксКод + 1, "ЧГ=");
		КонецЕсли;
		Пока Лев(Код, 1) = "0" Цикл
			Код = Сред(Код, 2);
		КонецЦикла;
	Иначе
		Если ЭтоНовый() Тогда
			Попытка
				УстановитьСсылкуНового(Справочники.Классы.ПолучитьСсылку(Новый УникальныйИдентификатор(Код)));
			Исключение
				Сообщить(ОписаниеОшибки(), СтатусСообщения.Важное);
				Отказ = Истина;
			КонецПопытки;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
