// Модуль управляемой формы (ОбщаяФорма.ФормаУправляемая)

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	//Вставить содержимое обработчика
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Типы.Ссылка КАК Ссылка,
	|	Типы.ВерсияДанных КАК ВерсияДанных,
	|	Типы.ПометкаУдаления КАК ПометкаУдаления,
	|	Типы.Родитель КАК Родитель,
	|	Типы.ЭтоГруппа КАК ЭтоГруппа,
	|	Типы.ЭлементыКоллекции.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		Тип КАК Тип
	|	) КАК ЭлементыКоллекции,
	|	Типы.Доступность.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		Доступность КАК Доступность
	|	) КАК Доступность
	|ИЗ
	|	Справочник.Типы КАК Типы";
	
КонецПроцедуры

&НаКлиенте
Процедура ДинамическийСписокПриАктивизацииСтроки(Элемент)
	
	Сообщить(Элемент);
	
КонецПроцедуры
