Процедура ВыполнитьЗаполнение() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Ссылка
	|	,Код
	|
	|ИЗ
	|	Справочник.Типы
	|
	|ГДЕ
	|	Не ЭтоГруппа
	|	И Не Предопределенный
	|
	|
	|";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если СтрДлина(Выборка.Код) = 36 Тогда
			ТипЗначения = ЗначениеИзСтрокиВнутр("{""T""," + Выборка.Код + "}");
			Если ТипЗначения <> Неопределено Тогда
				Об = Выборка.Ссылка.ПолучитьОбъект();
				Об.АнгСиноним = Строка(ТипЗначения);
				Об.Записать();
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
