Процедура СохранитьНастройкиСериализации() Экспорт
	
	// Проверка
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Типы.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Типы КАК Типы
	|ГДЕ
	|	НЕ Типы.ЭтоГруппа";
	
	Выборка = Запрос.Выполнить().Выбрать();
	СтруктураОбщегоХранения = Новый Соответствие();
	
	Пока Выборка.Следующий() Цикл
		
		СтруктураХранения = Выборка.Ссылка.ХранилищеДереваСериализации.Получить();
		
		Если СтруктураХранения <> Неопределено Тогда
			
			СтруктураОбщегоХранения.Вставить(Выборка.Ссылка.Наименование, СтруктураХранения);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Константы.ХранилищеНастроекСериализации.Установить(Новый ХранилищеЗначения(СтруктураОбщегоХранения));
	
КонецПроцедуры

Процедура ВосстановитьНастройкиСериализации() Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Типы.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Типы КАК Типы
	|ГДЕ
	|	НЕ Типы.ЭтоГруппа
	|	И Типы.Наименование = &Имя";
		
	СтруктураОбщегоХранения = Константы.ХранилищеНастроекСериализации.Получить().Получить();
	
	Если ТипЗнч(СтруктураОбщегоХранения) <> Тип("Соответствие") Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого Запись Из СтруктураОбщегоХранения Цикл
		
		Имя = Запись.Ключ;
		СтруктураХранения = Запись.Значение;
		Запрос.УстановитьПараметр("Имя", Имя);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			СпрСсылка = Выборка.Ссылка;
			СпрОбъект = СпрСсылка.ПолучитьОбъект();
			СпрОбъект.ХранилищеДереваСериализации = Новый ХранилищеЗначения(СтруктураХранения);
			СпрОбъект.Записать();
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьСписокВерсий1С() Экспорт
	
	СписокВерсий1С = Новый СписокЗначений;
	СписокВерсий1С.Добавить("8.0");
	СписокВерсий1С.Добавить("8.1");
	СписокВерсий1С.Добавить("8.2");
	СписокВерсий1С.Добавить("8.2.14");
	СписокВерсий1С.Добавить("8.3.1");
	СписокВерсий1С.Добавить("8.3.2");
	СписокВерсий1С.Добавить("8.3.3");
	СписокВерсий1С.Добавить("8.3.4");
	СписокВерсий1С.Добавить("8.3.5");
	СписокВерсий1С.Добавить("8.3.6");
	СписокВерсий1С.Добавить("8.3.7");
	СписокВерсий1С.Добавить("8.3.8");
	СписокВерсий1С.Добавить("8.3.9");
	СписокВерсий1С.Добавить("8.3.10");
	СписокВерсий1С.Добавить("8.3.11");
	СписокВерсий1С.Добавить("8.3.12");
	СписокВерсий1С.Добавить("8.3.13");
	СписокВерсий1С.Добавить("8.3.14");
	СписокВерсий1С.Добавить("8.3.15");
	СписокВерсий1С.Добавить("8.3.16");
	СписокВерсий1С.Добавить("8.3.17");
	СписокВерсий1С.Добавить("8.3.18");
	СписокВерсий1С.Добавить("8.3.19");
	СписокВерсий1С.Добавить("8.3.20");
	СписокВерсий1С.Добавить("8.3.21");
	СписокВерсий1С.Добавить("8.3.22");
	СписокВерсий1С.Добавить("8.3.23");
	СписокВерсий1С.Добавить("8.3.24");
	СписокВерсий1С.Добавить("8.3.25");
	СписокВерсий1С.Добавить("8.3.26");
	СписокВерсий1С.Добавить("8.3.27");
	СписокВерсий1С.Добавить("8.5.1");
	СписокВерсий1С.Добавить("8.5.2");
	СписокВерсий1С.Добавить("8.5.3");

	Возврат СписокВерсий1С;
	
КонецФункции
