Процедура Выгрузка(Файл) Экспорт
	Дерево = Новый ДеревоЗначений;
	Дерево.Колонки.Добавить("Значение");
	Запрос = Новый Запрос;
	
	// Параметры классов
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Наименование
	|
	|ИЗ
	|	Справочник.ПараметрыКлассов
	|
	|УПОРЯДОЧИТЬ ПО
	|	Наименование
	|
	|";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Всего = Выборка.Количество();
	ДобавитьЗначениеВДерево(Дерево, Всего);
	Пока Выборка.Следующий() Цикл
		СтрокаПараметра = Дерево.Строки.Добавить();
		ДобавитьЗначениеВДерево(СтрокаПараметра, Выборка.Наименование);
	КонецЦикла;
	
	// Классы
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Ссылка
	|
	|ИЗ
	|	Справочник.Классы
	|
	|ГДЕ
	|	НЕ ЭтоГруппа
	|
	|УПОРЯДОЧИТЬ ПО
	|	Код
	|
	|";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Всего = Выборка.Количество();
	ДобавитьЗначениеВДерево(Дерево, Всего);
	Пока Выборка.Следующий() Цикл
		СтрокаКласса = Дерево.Строки.Добавить();
		Класс = Выборка.Ссылка;
		ДобавитьЗначениеВДерево(СтрокаКласса, Класс.Код);
		
		СтрокаДопустимыхЗначенийВерсии = СтрокаКласса.Строки.Добавить();
		ДобавитьЗначениеВДерево(СтрокаДопустимыхЗначенийВерсии, Класс.ДопустимыеЗначенияВерсии.Количество());
		Для каждого ДопустимоеЗначениеВерсии Из Класс.ДопустимыеЗначенияВерсии Цикл
			ДобавитьЗначениеВДерево(СтрокаДопустимыхЗначенийВерсии, ДопустимоеЗначениеВерсии.Значение);
			ДобавитьЗначениеВДерево(СтрокаДопустимыхЗначенийВерсии, ДопустимоеЗначениеВерсии.Версия1С);
		КонецЦикла;
		
		СтрокаПараметров = СтрокаКласса.Строки.Добавить();
		ДобавитьЗначениеВДерево(СтрокаПараметров, Класс.Параметры.Количество());
		Для каждого Параметр Из Класс.Параметры Цикл
			ДобавитьЗначениеВДерево(СтрокаПараметров, Параметр.Параметр.Наименование);
			ДобавитьЗначениеВДерево(СтрокаПараметров, Параметр.Значение);
		КонецЦикла;
		
		СтрокаСтандартныхРеквизитов = СтрокаКласса.Строки.Добавить();
		ДобавитьЗначениеВДерево(СтрокаСтандартныхРеквизитов, Класс.СтандартныеРеквизиты.Количество());
		Для каждого СтандартныйРеквизит Из Класс.СтандартныеРеквизиты Цикл
			СтрокаСтандартногоРеквизита = СтрокаСтандартныхРеквизитов.Строки.Добавить();
			ДобавитьЗначениеВДерево(СтрокаСтандартногоРеквизита, СтандартныйРеквизит.Имя);
			ДобавитьЗначениеВДерево(СтрокаСтандартногоРеквизита, СтандартныйРеквизит.АнгИмя);
			ДобавитьЗначениеВДерево(СтрокаСтандартногоРеквизита, СтандартныйРеквизит.Значение);
			ДобавитьЗначениеВДерево(СтрокаСтандартногоРеквизита, СтандартныйРеквизит.Счетный);
			ДобавитьЗначениеВДерево(СтрокаСтандартногоРеквизита, СтандартныйРеквизит.ЗначениеМакс);
			ДобавитьЗначениеВДерево(СтрокаСтандартногоРеквизита, СтандартныйРеквизит.ИД);
		КонецЦикла;
		
		СтрокаСтандартныхТабличныхЧастей = СтрокаКласса.Строки.Добавить();
		ДобавитьЗначениеВДерево(СтрокаСтандартныхТабличныхЧастей, Класс.СтандартныеТабличныеЧасти.Количество());
		Для каждого СтандартнаяТабличнаяЧасть Из Класс.СтандартныеТабличныеЧасти Цикл
			СтрокаСтандартнойТабличнойЧасти = СтрокаСтандартныхТабличныхЧастей.Строки.Добавить();
			ДобавитьЗначениеВДерево(СтрокаСтандартнойТабличнойЧасти, СтандартнаяТабличнаяЧасть.Имя);
			ДобавитьЗначениеВДерево(СтрокаСтандартнойТабличнойЧасти, СтандартнаяТабличнаяЧасть.АнгИмя);
			ДобавитьЗначениеВДерево(СтрокаСтандартнойТабличнойЧасти, СтандартнаяТабличнаяЧасть.Значение);
			ДобавитьЗначениеВДерево(СтрокаСтандартнойТабличнойЧасти, ?(СтандартнаяТабличнаяЧасть.Класс.Пустая(), "", Новый УникальныйИдентификатор(СтандартнаяТабличнаяЧасть.Класс.Код)));
		КонецЦикла;
		
	КонецЦикла;
	
	// Типы
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Ссылка
	|
	|ИЗ
	|	Справочник.Типы
	|
	|ГДЕ
	|	НЕ ЭтоГруппа
	|
	|УПОРЯДОЧИТЬ ПО
	|	Наименование
	|
	|";
	
	ЗапросСвойства = Новый Запрос;
	ЗапросСвойства.Текст = "
	|ВЫБРАТЬ
	|	Ссылка
	|
	|ИЗ
	|	Справочник.Свойства
	|
	|ГДЕ
	|	Владелец = &Тип
	|
	|УПОРЯДОЧИТЬ ПО
	|	Наименование
	|
	|";
	
	ЗапросЗначения = Новый Запрос;
	ЗапросЗначения.Текст = "
	|ВЫБРАТЬ
	|	Ссылка
	|
	|ИЗ
	|	Справочник.Значения
	|
	|ГДЕ
	|	Владелец = &Тип
	|
	|УПОРЯДОЧИТЬ ПО
	|	Наименование
	|
	|";
	
	ТаблицаСериализуемыхТипов = Новый ТаблицаЗначений;
	ТаблицаСериализуемыхТипов.Колонки.Добавить("ИмяТипа");
	ТаблицаСериализуемыхТипов.Колонки.Добавить("СтруктураСериализации");
	
	Выборка = Запрос.Выполнить().Выбрать();
	Всего = Выборка.Количество();
	ДобавитьЗначениеВДерево(Дерево, Всего);
	СчетчикТипов = 0;
	
	Пока Выборка.Следующий() Цикл
		СчетчикТипов = СчетчикТипов + 1;
		//Состояние("" + СчетчикТипов + " из " + Всего);
		_Тип = Выборка.Ссылка;
		СтрокаТипа = Дерево.Строки.Добавить();
		ДобавитьЗначениеВДерево(СтрокаТипа, _Тип.Наименование);
		ДобавитьЗначениеВДерево(СтрокаТипа, _Тип.АнгИмя);
		ДобавитьЗначениеВДерево(СтрокаТипа, ?(СтрДлина(_Тип.Код) = 36, Новый УникальныйИдентификатор(_Тип.Код), ""));
		ДобавитьЗначениеВДерево(СтрокаТипа, _Тип.ВариантЗагрузки);
		ДобавитьЗначениеВДерево(СтрокаТипа, _Тип.ИмяМета);
		ДобавитьЗначениеВДерево(СтрокаТипа, _Тип.АнгИмяМета);
		ДобавитьЗначениеВДерево(СтрокаТипа, _Тип.ИндексКартинки);
		ДобавитьЗначениеВДерево(СтрокаТипа, _Тип.ИндексКолонкиИмяПредопределенного);
		ДобавитьЗначениеВДерево(СтрокаТипа, _Тип.ИндексКолонкиИДПредопределенного);
		ДобавитьЗначениеВДерево(СтрокаТипа, _Тип.ОбъектМетаданных);
		ДобавитьЗначениеВДерево(СтрокаТипа, ПривестиЗначениеСпособаВыгрузки(_Тип.СпособВыгрузки));
		ДобавитьЗначениеВДерево(СтрокаТипа, ?(_Тип.КлассПоУмолчанию.Пустая(), "", Новый УникальныйИдентификатор(_Тип.КлассПоУмолчанию.Код)));
		
		СтрокаСвойств = СтрокаТипа.Строки.Добавить();
		ЗапросСвойства.УстановитьПараметр("Тип", _Тип);
		ВыборкаСвойств = ЗапросСвойства.Выполнить().Выбрать();
		ДобавитьЗначениеВДерево(СтрокаСвойств, ВыборкаСвойств.Количество());
		Пока ВыборкаСвойств.Следующий() Цикл
			Свойство = ВыборкаСвойств.Ссылка;
			СтрокаСвойства = СтрокаСвойств.Строки.Добавить();
			ДобавитьЗначениеВДерево(СтрокаСвойства, Свойство.Наименование);
			ДобавитьЗначениеВДерево(СтрокаСвойства, Свойство.АнгИмя);
			ДобавитьЗначениеВДерево(СтрокаСвойства, Свойство.ЭтоПредопределенные);
			ДобавитьЗначениеВДерево(СтрокаСвойства, ПривестиЗначениеСпособаВыгрузки(Свойство.СпособВыгрузки));
			ДобавитьЗначениеВДерево(СтрокаСвойства, ?(Свойство.Класс.Пустая(), "", Новый УникальныйИдентификатор(Свойство.Класс.Код)));
			
			СтрокаТиповСвойства = СтрокаСвойства.Строки.Добавить();
			СтрокаКолВоТиповСвойства = СтрокаТиповСвойства.Строки.Добавить();
			СтрокаКолВоТиповСвойства.Значение = Свойство.Типы.Количество();
			Для каждого ТипСвойства Из Свойство.Типы Цикл
				ДобавитьЗначениеВДерево(СтрокаТиповСвойства, ТипСвойства.Тип.Наименование);
			КонецЦикла;
		КонецЦикла;
		
		СтрокаТиповЭлементовКоллекции = СтрокаТипа.Строки.Добавить();
		ДобавитьЗначениеВДерево(СтрокаТиповЭлементовКоллекции, _Тип.ЭлементыКоллекции.Количество());
		Для каждого ТипЭлементаКоллекции Из _Тип.ЭлементыКоллекции Цикл
			ДобавитьЗначениеВДерево(СтрокаТиповЭлементовКоллекции, ТипЭлементаКоллекции.Тип.Наименование);
		КонецЦикла;
		
		СтрокаЗначений = СтрокаТипа.Строки.Добавить();
		ЗапросЗначения.УстановитьПараметр("Тип", _Тип);
		ВыборкаЗначений = ЗапросЗначения.Выполнить().Выбрать();
		ДобавитьЗначениеВДерево(СтрокаЗначений, ВыборкаЗначений.Количество());
		Пока ВыборкаЗначений.Следующий() Цикл
			Значение = ВыборкаЗначений.Ссылка;
			СтрокаЗначения = СтрокаЗначений.Строки.Добавить();
			ДобавитьЗначениеВДерево(СтрокаЗначения, Значение.Наименование);
			ДобавитьЗначениеВДерево(СтрокаЗначения, Значение.АнгИмя);
			//ДобавитьЗначениеВДерево(СтрокаЗначения, Значение.Описание);
			ДобавитьЗначениеВДерево(СтрокаЗначения, Значение.Значение);
			Если ЗначениеЗаполнено(Значение.ЗначениеУИД) Тогда
				ДобавитьЗначениеВДерево(СтрокаЗначения, Значение.ЗначениеУИД);
			Иначе
				ДобавитьЗначениеВДерево(СтрокаЗначения, Неопределено);
			КонецЕсли;
		КонецЦикла;
		
		СтрокаГенерируемыхТипов = СтрокаТипа.Строки.Добавить();
		ДобавитьЗначениеВДерево(СтрокаГенерируемыхТипов, _Тип.ПрефиксГенерируемыхТипов);
		ДобавитьЗначениеВДерево(СтрокаГенерируемыхТипов, _Тип.ПрефиксГенерируемыхТиповАнг);
		ДобавитьЗначениеВДерево(СтрокаГенерируемыхТипов, _Тип.ГенерируемыеТипы.Количество());
		Для каждого ГенерируемыйТип Из _Тип.ГенерируемыеТипы Цикл
			СтрокаГенерируемогоТипа = СтрокаГенерируемыхТипов.Строки.Добавить();
			ДобавитьЗначениеВДерево(СтрокаГенерируемогоТипа, ГенерируемыйТип.Имя);
			ДобавитьЗначениеВДерево(СтрокаГенерируемогоТипа, ГенерируемыйТип.АнгИмя);
			ДобавитьЗначениеВДерево(СтрокаГенерируемогоТипа, ГенерируемыйТип.БезПрефикса);
		КонецЦикла;
		
		СтруктураСериализации = _Тип.ХранилищеДереваСериализации.Получить();
		Если ТипЗнч(СтруктураСериализации) = Тип("Структура") Тогда
			Если СтруктураСериализации.Переменные.Количество() > 0 Или СтруктураСериализации.ДеревоСериализации.Строки.Количество() > 0 Или СтруктураСериализации.ВнешниеФайлы.Количество() > 0 Тогда
				стр = ТаблицаСериализуемыхТипов.Добавить();
				стр.ИмяТипа = _Тип.Наименование;
				стр.СтруктураСериализации = СтруктураСериализации;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	// Значения по умолчанию
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Владелец.Наименование КАК ИмяТипа
	|	,Наименование КАК Свойство
	|	,ЗначениеПоУмолчанию КАК ЗначениеПоУмолчанию
	|
	|ИЗ
	|	Справочник.Свойства
	|
	|ГДЕ
	|	ЗначениеПоУмолчанию <> ЗНАЧЕНИЕ(Справочник.Значения.ПустаяСсылка)
	|	И ЗначениеПоУмолчанию <> ЗНАЧЕНИЕ(Справочник.Типы.ПустаяСсылка)
	|	И ЗначениеПоУмолчанию <> Неопределено
	|	И ЗначениеПоУмолчанию <> ЗНАЧЕНИЕ(Перечисление.ПримитивныеЗначенияПоУмолчанию.ПустаяСсылка)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ИмяТипа
	|";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Всего = Выборка.Количество();
	ДобавитьЗначениеВДерево(Дерево, Всего);
	Пока Выборка.Следующий() Цикл
		СтрокаЗначения = Дерево.Строки.Добавить();
		ДобавитьЗначениеВДерево(СтрокаЗначения, Выборка.ИмяТипа);
		ДобавитьЗначениеВДерево(СтрокаЗначения, Выборка.Свойство);
		ЗначениеПоУмолчанию = Выборка.ЗначениеПоУмолчанию;
		ДобавитьЗначениеВДерево(СтрокаЗначения, ПолучитьВидЗначенияПоУмолчанию(ЗначениеПоУмолчанию));
		ДобавитьЗначениеВДерево(СтрокаЗначения, ПолучитьЗначениеПоУмолчанию(ЗначениеПоУмолчанию));
		ДобавитьЗначениеВДерево(СтрокаЗначения, ПолучитьИмяЗначенияПоУмолчанию(ЗначениеПоУмолчанию));
	КонецЦикла;
	
	// Предопределенные объекты метаданных	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Код
	|	,Наименование
	|	,АнгИмя
	|
	|ИЗ
	|	Справочник.ПредопределенныеОбъектыМетаданных
	|
	|УПОРЯДОЧИТЬ ПО
	|	Наименование
	|
	|";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Всего = Выборка.Количество();
	ДобавитьЗначениеВДерево(Дерево, Всего);
	Пока Выборка.Следующий() Цикл
		СтрокаЗначения = Дерево.Строки.Добавить();
		ДобавитьЗначениеВДерево(СтрокаЗначения, Выборка.Наименование);
		ДобавитьЗначениеВДерево(СтрокаЗначения, Выборка.АнгИмя);
		ДобавитьЗначениеВДерево(СтрокаЗначения, Выборка.Код);
	КонецЦикла;
	
	// Права
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Код
	|	,Наименование
	|	,АнгИмя
	|	,Версия1С
	|
	|ИЗ
	|	Справочник.Права
	|
	|УПОРЯДОЧИТЬ ПО
	|	Наименование
	|
	|";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Всего = Выборка.Количество();
	ДобавитьЗначениеВДерево(Дерево, Всего);
	Пока Выборка.Следующий() Цикл
		СтрокаЗначения = Дерево.Строки.Добавить();
		ДобавитьЗначениеВДерево(СтрокаЗначения, Выборка.Наименование);
		ДобавитьЗначениеВДерево(СтрокаЗначения, Выборка.АнгИмя);
		ДобавитьЗначениеВДерево(СтрокаЗначения, Выборка.Код);
		ДобавитьЗначениеВДерево(СтрокаЗначения, Выборка.Версия1С);
	КонецЦикла;
	
	// Деревья сериализации
	Всего = ТаблицаСериализуемыхТипов.Количество();
	ДобавитьЗначениеВДерево(Дерево, Всего);
	СчетчикТипов = 0;
	Для каждого стр Из ТаблицаСериализуемыхТипов Цикл
		СчетчикТипов = СчетчикТипов + 1;
		//Состояние("" + СчетчикТипов + " из " + Всего);
		СтрокаТипа = Дерево.Строки.Добавить();
		ДобавитьЗначениеВДерево(СтрокаТипа, стр.ИмяТипа);
		ДобавитьДеревоСериализации(СтрокаТипа, стр.СтруктураСериализации);
	КонецЦикла;
	
	
	//Состояние("Запись");
	ОбщаяОбработка = Обработки.Общая.Создать();
	//Текст = Новый ТекстовыйДокумент;
	//Текст.УстановитьТекст(ОбщаяОбработка.ДеревоВСтроку(Дерево));
	//Текст.Записать(Файл);
	
	ОбщаяОбработка.ДеревоВФайл(Дерево, Файл);
	//Состояние("Готово");
	
КонецПроцедуры

Процедура ДобавитьЗначениеВДерево(Стр, Значение)
	СтрокаЗначения = Стр.Строки.Добавить();
	СтрокаЗначения.Значение = Значение;
КонецПроцедуры

Процедура ДобавитьДеревоСериализации(СтрокаСтруктурыСериализации, СтруктураСериализации)
	Переменные = СтруктураСериализации.Переменные;
	СтрокаПеременных = СтрокаСтруктурыСериализации.Строки.Добавить();
	ДобавитьЗначениеВДерево(СтрокаПеременных, Переменные.Количество());
	Для каждого Переменная Из Переменные Цикл
		СтрокаПеременной = СтрокаПеременных.Строки.Добавить();
		ДобавитьЗначениеВДерево(СтрокаПеременной, Переменная.Имя);
		ДобавитьЗначениеВДерево(СтрокаПеременной, Переменная.СчетчикКоллекции);
		ДобавитьЗначениеВДерево(СтрокаПеременной, Переменная.Глобальная);
		ДобавитьЗначениеВДерево(СтрокаПеременной, Переменная.Фиксированная);
		ДобавитьЗначениеВДерево(СтрокаПеременной, Переменная.ГлобальноеЗначение);
		СтрокаДопустимыхЗначений = СтрокаПеременной.Строки.Добавить();
		КолвоДопустимыхЗначений = Переменная.ДопустимыеЗначения.Количество();
		ДобавитьЗначениеВДерево(СтрокаДопустимыхЗначений, КолвоДопустимыхЗначений);
		Для каждого ДопустимоеЗначение Из Переменная.ДопустимыеЗначения Цикл
			ДобавитьЗначениеВДерево(СтрокаДопустимыхЗначений, ДопустимоеЗначение.Значение);
			ДобавитьЗначениеВДерево(СтрокаДопустимыхЗначений, ДопустимоеЗначение.Версия1С);
			ДобавитьЗначениеВДерево(СтрокаДопустимыхЗначений, ДопустимоеЗначение.ГлобальноеЗначение);
		КонецЦикла;
	КонецЦикла;
	
	ДеревоСериализации = СтруктураСериализации.ДеревоСериализации;
	СтрокаДереваСериализации = СтрокаСтруктурыСериализации.Строки.Добавить();
	ДобавитьСтрокиСериализацииВДерево(СтрокаДереваСериализации, ДеревоСериализации.Строки);
	
	ВнешниеФайлы = Неопределено;
	СтрокаВнешнихФайлов = СтрокаСтруктурыСериализации.Строки.Добавить();
	Если СтруктураСериализации.Свойство("ВнешниеФайлы", ВнешниеФайлы) Тогда
		ДобавитьЗначениеВДерево(СтрокаВнешнихФайлов, ВнешниеФайлы.Количество());
		Для каждого ВнешнийФайл Из ВнешниеФайлы Цикл
			СтрокаВнешнегоФайла = СтрокаВнешнихФайлов.Строки.Добавить();
			ДобавитьЗначениеВДерево(СтрокаВнешнегоФайла, ВнешнийФайл.Свойство);
			ДобавитьЗначениеВДерево(СтрокаВнешнегоФайла, ВнешнийФайл.ОтносительныйПуть);
			ДобавитьЗначениеВДерево(СтрокаВнешнегоФайла, ВнешнийФайл.Имя);
			ДобавитьЗначениеВДерево(СтрокаВнешнегоФайла, ВнешнийФайл.Расширение);
			ДобавитьЗначениеВДерево(СтрокаВнешнегоФайла, ВнешнийФайл.Каталог);
			ДобавитьЗначениеВДерево(СтрокаВнешнегоФайла, ВнешнийФайл.ИмяФайла);
			ДобавитьЗначениеВДерево(СтрокаВнешнегоФайла, ПривестиЗначениеФорматаВнешнегоФайла(ВнешнийФайл.Формат));
			ДобавитьЗначениеВДерево(СтрокаВнешнегоФайла, ВнешнийФайл.Тип);
			ДобавитьЗначениеВДерево(СтрокаВнешнегоФайла, ВнешнийФайл.Необязательный);
			ДобавитьЗначениеВДерево(СтрокаВнешнегоФайла, ВнешнийФайл.Версия1С);
			ДобавитьЗначениеВДерево(СтрокаВнешнегоФайла, ВнешнийФайл.ЕстьУсловие);
			Если ВнешнийФайл.ЕстьУсловие Тогда
				ДобавитьЗначениеВДерево(СтрокаВнешнегоФайла, ПривестиЗначениеТипаЗначения(ВнешнийФайл.Условие));
				ДобавитьЗначениеВДерево(СтрокаВнешнегоФайла, ВнешнийФайл.Значение1);
				ДобавитьЗначениеВДерево(СтрокаВнешнегоФайла, ВнешнийФайл.Значение2);
			КонецЕсли;
		КонецЦикла;
	Иначе
		ДобавитьЗначениеВДерево(СтрокаВнешнихФайлов, 0);
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьСтрокиСериализацииВДерево(ТекСтрокаДереваСериализации, Строки)
	ДобавитьЗначениеВДерево(ТекСтрокаДереваСериализации, Строки.Количество());
	Для каждого Стр Из Строки Цикл
		ДобавитьСтрокуСериализацииВДерево(ТекСтрокаДереваСериализации, Стр);		
	КонецЦикла;
КонецПроцедуры

Процедура ДобавитьСтрокуСериализацииВДерево(ТекСтрокаДереваСериализации, Стр)
	Если Стр.ТипУзла = Перечисления.ТипыУзловДереваСериализации.ПодДерево Тогда
		СпрПодДерево = Справочники.Поддеревья.НайтиПоНаименованию(Стр.Значение, Истина);
		Если СпрПодДерево = Неопределено Или СпрПодДерево.Пустая() Тогда
			Сообщить("Не найдено поддерево """ + Стр.Значение + """", СтатусСообщения.Важное);
		Иначе
			СтруктураХранения = СпрПодДерево.ХранилищеДереваСериализации.Получить();
			Если ТипЗнч(СтруктураХранения) = Тип("Структура") Тогда
				ДеревоСериализации = Неопределено;
				СтруктураХранения.Свойство("ДеревоСериализации", ДеревоСериализации);
				Если ТипЗнч(ДеревоСериализации) = Тип("ДеревоЗначений") Тогда
					ТекСтрокаДереваСериализации.Строки[0].Значение = ТекСтрокаДереваСериализации.Строки[0].Значение - 1 + ДеревоСериализации.Строки.Количество();
					Для каждого ПодСтр Из ДеревоСериализации.Строки Цикл
						ДобавитьСтрокуСериализацииВДерево(ТекСтрокаДереваСериализации, ПодСтр);
					КонецЦикла;
				Иначе
					Сообщить("Тип значения Дерева Сериализации поддерева """ + Стр.Значение + """ не ДеревоЗначений", СтатусСообщения.Важное);
				КонецЕсли;
			Иначе
				Сообщить("Тип значения в реквизите ХранилищеДереваСериализации поддерева """ + Стр.Значение + """ не Структура", СтатусСообщения.Важное);
			КонецЕсли;
		КонецЕсли;
	Иначе
		СтрокаДереваСериализации = ТекСтрокаДереваСериализации.Строки.Добавить();
		ДобавитьЗначениеВДерево(СтрокаДереваСериализации, ПривестиЗначениеТипаУзла(Стр.ТипУзла));
		ДобавитьЗначениеВДерево(СтрокаДереваСериализации, ПривестиЗначениеТипаЗначения(Стр.ТипЗначения));
		ДобавитьЗначениеВДерево(СтрокаДереваСериализации, Стр.Значение);
		ДобавитьЗначениеВДерево(СтрокаДереваСериализации, Стр.Значение2);
		ДобавитьЗначениеВДерево(СтрокаДереваСериализации, Стр.НеПеремещатьУказатель);
		ДобавитьЗначениеВДерево(СтрокаДереваСериализации, Стр.Ссылка);
		ДобавитьЗначениеВДерево(СтрокаДереваСериализации, Стр.СсылкаПредопределенного);
		ДобавитьЗначениеВДерево(СтрокаДереваСериализации, Стр.Право);
		ДобавитьЗначениеВДерево(СтрокаДереваСериализации, Стр.Внешний);
		ДобавитьЗначениеВДерево(СтрокаДереваСериализации, ПривестиЗначениеТипаСериализацииДвоичныхДанных(Стр.ТипСериализацииДвоичныхДанных));
		ДобавитьЗначениеВДерево(СтрокаДереваСериализации, ПривестиЗначениеФорматаВнешнегоФайла(Стр.ФорматДвоичныхДанных));
		ДобавитьСтрокиСериализацииВДерево(СтрокаДереваСериализации, Стр.Строки);
	КонецЕсли;
КонецПроцедуры

Функция ПривестиЗначениеТипаУзла(ТипУзла)
	Если ТипУзла = Перечисления.ТипыУзловДереваСериализации.Константа Тогда
		Возврат 1;
	ИначеЕсли ТипУзла = Перечисления.ТипыУзловДереваСериализации.Переменная Тогда
		Возврат 2;
	ИначеЕсли ТипУзла = Перечисления.ТипыУзловДереваСериализации.Список Тогда
		Возврат 3;
	ИначеЕсли ТипУзла = Перечисления.ТипыУзловДереваСериализации.Свойство Тогда
		Возврат 4;
	ИначеЕсли ТипУзла = Перечисления.ТипыУзловДереваСериализации.ЭлементКоллекции Тогда
		Возврат 5;
	ИначеЕсли ТипУзла = Перечисления.ТипыУзловДереваСериализации.ГенерируемыйТип Тогда
		Возврат 6;
	ИначеЕсли ТипУзла = Перечисления.ТипыУзловДереваСериализации.Условие Тогда
		Возврат 7;
	ИначеЕсли ТипУзла = Перечисления.ТипыУзловДереваСериализации.МетаИД Тогда
		Возврат 8;
	ИначеЕсли ТипУзла = Перечисления.ТипыУзловДереваСериализации.КоллекцияКлассов Тогда
		Возврат 9;
	ИначеЕсли ТипУзла = Перечисления.ТипыУзловДереваСериализации.Класс Тогда
		Возврат 10;
	ИначеЕсли ТипУзла = Перечисления.ТипыУзловДереваСериализации.КоллекцияИДЭлементов Тогда
		Возврат 11;
	ИначеЕсли ТипУзла = Перечисления.ТипыУзловДереваСериализации.ИДЭлемент Тогда
		Возврат 12;
	КонецЕсли;
	Возврат 0;
КонецФункции

Функция ПривестиЗначениеФорматаВнешнегоФайла(ВидВнешнегоФайла)
	Если ВидВнешнегоФайла = Перечисления.ФорматыВнешнихФайлов.СериализованноеЗначение Тогда
		Возврат 1;
	ИначеЕсли ВидВнешнегоФайла = Перечисления.ФорматыВнешнихФайлов.ИсходныйТекст Тогда
		Возврат 2;
	ИначеЕсли ВидВнешнегоФайла = Перечисления.ФорматыВнешнихФайлов.ТабличныйДокумент Тогда
		Возврат 3;
	ИначеЕсли ВидВнешнегоФайла = Перечисления.ФорматыВнешнихФайлов.ДвоичныеДанные Тогда
		Возврат 4;
	ИначеЕсли ВидВнешнегоФайла = Перечисления.ФорматыВнешнихФайлов.ActiveДокумент Тогда
		Возврат 5;
	ИначеЕсли ВидВнешнегоФайла = Перечисления.ФорматыВнешнихФайлов.HTMLДокумент Тогда
		Возврат 6;
	ИначеЕсли ВидВнешнегоФайла = Перечисления.ФорматыВнешнихФайлов.ТекстовыйДокумент Тогда
		Возврат 7;
	ИначеЕсли ВидВнешнегоФайла = Перечисления.ФорматыВнешнихФайлов.ГеографическаяСхема Тогда
		Возврат 8;
	ИначеЕсли ВидВнешнегоФайла = Перечисления.ФорматыВнешнихФайлов.СхемаКомпоновкиДанных Тогда
		Возврат 9;
	ИначеЕсли ВидВнешнегоФайла = Перечисления.ФорматыВнешнихФайлов.МакетОформленияКомпоновкиДанных Тогда
		Возврат 10;
	ИначеЕсли ВидВнешнегоФайла = Перечисления.ФорматыВнешнихФайлов.ГрафическаяСхема Тогда
		Возврат 11;
	ИначеЕсли ВидВнешнегоФайла = Перечисления.ФорматыВнешнихФайлов.XML Тогда
		Возврат 12;
	ИначеЕсли ВидВнешнегоФайла = Перечисления.ФорматыВнешнихФайлов.WSDL Тогда
		Возврат 13;
	ИначеЕсли ВидВнешнегоФайла = Перечисления.ФорматыВнешнихФайлов.Картинка Тогда
		Возврат 14;
	КонецЕсли;
	Возврат 0;
КонецФункции

Функция ПривестиЗначениеТипаСериализацииДвоичныхДанных(ТипСериализацииДвоичныхДанных)
	Если ТипСериализацииДвоичныхДанных = Перечисления.ТипыСериализацииДвоичныхДанных.БезПрефикса Тогда
		Возврат 1;
	ИначеЕсли ТипСериализацииДвоичныхДанных = Перечисления.ТипыСериализацииДвоичныхДанных.ПрефиксBase64 Тогда
		Возврат 2;
	ИначеЕсли ТипСериализацииДвоичныхДанных = Перечисления.ТипыСериализацииДвоичныхДанных.ПрефиксData Тогда
		Возврат 3;
	ИначеЕсли ТипСериализацииДвоичныхДанных = Перечисления.ТипыСериализацииДвоичныхДанных.ПрефиксBase64ИлиData Тогда
		Возврат 4;
	КонецЕсли;
	Возврат 0;
КонецФункции

Функция ПривестиЗначениеТипаЗначения(ТипЗначения)
	//, ПеречислениеСсылка.ВидыУсловий, Строка
	Если ТипЗнч(ТипЗначения) = Тип("ПеречислениеСсылка.ТипыЗначенийСериализации") Тогда
		Если ТипЗначения = Перечисления.ТипыЗначенийСериализации.Строка Тогда
			Возврат 1;
		ИначеЕсли ТипЗначения = Перечисления.ТипыЗначенийСериализации.Число Тогда
			Возврат 2;
		ИначеЕсли ТипЗначения = Перечисления.ТипыЗначенийСериализации.УникальныйИдентификатор Тогда
			Возврат 3;
		КонецЕсли;
		Возврат 0;
	ИначеЕсли ТипЗнч(ТипЗначения) = Тип("ПеречислениеСсылка.ВидыУсловий") Тогда
		Если ТипЗначения = Перечисления.ВидыУсловий.Равно Тогда
			Возврат 1;
		ИначеЕсли ТипЗначения = Перечисления.ВидыУсловий.НеРавно Тогда
			Возврат 2;
		ИначеЕсли ТипЗначения = Перечисления.ВидыУсловий.Меньше Тогда
			Возврат 3;
		ИначеЕсли ТипЗначения = Перечисления.ВидыУсловий.Больше Тогда
			Возврат 4;
		ИначеЕсли ТипЗначения = Перечисления.ВидыУсловий.МеньшеИлиРавно Тогда
			Возврат 5;
		ИначеЕсли ТипЗначения = Перечисления.ВидыУсловий.БольшеИлиРавно Тогда
			Возврат 6;
		ИначеЕсли ТипЗначения = Перечисления.ВидыУсловий.УстановленБит Тогда
			Возврат 7;
		ИначеЕсли ТипЗначения = Перечисления.ВидыУсловий.НеУстановленБит Тогда
			Возврат 8;
		КонецЕсли;
	ИначеЕсли ТипЗнч(ТипЗначения) = Тип("ПеречислениеСсылка.ВидыКоллекцийКлассов") Тогда
		Если ТипЗначения = Перечисления.ВидыКоллекцийКлассов.ИДВСписке Тогда
			Возврат 1;
		ИначеЕсли ТипЗначения = Перечисления.ВидыКоллекцийКлассов.ИДНеВСписке Тогда
			Возврат 2;
		КонецЕсли;
	КонецЕсли;
	Возврат Строка(ТипЗначения);
КонецФункции

Процедура СохранитьВсеДеревьяСериализации(Файл) Экспорт
	Структура = Новый Соответствие;
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Ссылка
	|
	|ИЗ
	|	Справочник.Типы
	|
	|ГДЕ
	|	НЕ ЭтоГруппа
	|
	|УПОРЯДОЧИТЬ ПО
	|	Наименование
	|
	|";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		_Тип = Выборка.Ссылка;
		СтруктураСериализации = _Тип.ХранилищеДереваСериализации.Получить();
		Если ТипЗнч(СтруктураСериализации) = Тип("Структура") Тогда
			Структура.Вставить(_Тип.Наименование, СтруктураСериализации);
		КонецЕсли;
	КонецЦикла;
	
	ЗначениеВФайл(Файл, Структура);
	
	Сообщить("Деревья сериализации сохранены в файл " + Файл);
КонецПроцедуры

Процедура ЗагрузитьВсеДеревьяСериализации(Файл) Экспорт
	Структура = ЗначениеИзФайла(Файл);
	Если ТипЗнч(Структура) <> Тип("Структура") И ТипЗнч(Структура) <> Тип("Соответствие") Тогда
		Сообщить("Деревья сериализации не загружены", СтатусСообщения.Важное);
		Возврат;
	КонецЕсли;
	
	Для каждого стр Из Структура Цикл
		_Тип = НайтиТип(стр.Ключ);
		Если _Тип <> Неопределено Тогда
			Об = _Тип.ПолучитьОбъект();
			Об.ХранилищеДереваСериализации = Новый ХранилищеЗначения(стр.Значение);
			Об.Записать();
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Функция НайтиТип(ИмяТипа)
	Результат = Справочники.Типы.НайтиПоНаименованию(ИмяТипа, Истина);
	Если Результат = Неопределено Или Результат.Пустая() Тогда
		Сообщить("Не найден тип """ + ИмяТипа + """", СтатусСообщения.ОченьВажное);
		Возврат Неопределено;
	КонецЕсли;
	Возврат Результат;
КонецФункции

Функция ПривестиЗначениеСпособаВыгрузки(СпособаВыгрузки)
	Если СпособаВыгрузки = Перечисления.СпособВыгрузки.ВКаталог Тогда
		Возврат 1;
	ИначеЕсли СпособаВыгрузки = Перечисления.СпособВыгрузки.ВФайл Тогда
		Возврат 2;
	КонецЕсли;
	Возврат 0;
КонецФункции

Функция ПолучитьВидЗначенияПоУмолчанию(ЗначениеПоУмолчанию)
	ТипЗначения = ТипЗнч(ЗначениеПоУмолчанию);
	Если ТипЗначения = Тип("Булево") Тогда
		Возврат 1;
	ИначеЕсли ТипЗначения = Тип("Число") Тогда
		Возврат 2;
	ИначеЕсли ТипЗначения = Тип("Строка") Тогда
		Возврат 3;
	ИначеЕсли ТипЗначения = Тип("Дата") Тогда
		Возврат 4;
	ИначеЕсли ТипЗначения = Тип("ПеречислениеСсылка.ПримитивныеЗначенияПоУмолчанию") Тогда
		Если ЗначениеПоУмолчанию = Перечисления.ПримитивныеЗначенияПоУмолчанию.Неопределено Тогда
			Возврат 5;
		ИначеЕсли ЗначениеПоУмолчанию = Перечисления.ПримитивныеЗначенияПоУмолчанию.Null Тогда
			Возврат 6;
		КонецЕсли;
	ИначеЕсли ТипЗначения = Тип("СправочникСсылка.Типы") Тогда
		Если Не ЗначениеПоУмолчанию.Пустая() Тогда
			Возврат 7;
		КонецЕсли;
	ИначеЕсли ТипЗначения = Тип("СправочникСсылка.Значения") Тогда
		Если Не ЗначениеПоУмолчанию.Пустая() Тогда
			Возврат 8;
		КонецЕсли;
	КонецЕсли;
	Сообщить("Не удалось определить вид значения по умолчанию " + ЗначениеПоУмолчанию, СтатусСообщения.Важное);
	Возврат 0;
КонецФункции

Функция ПолучитьЗначениеПоУмолчанию(ЗначениеПоУмолчанию)
	ТипЗначения = ТипЗнч(ЗначениеПоУмолчанию);
	Если ТипЗначения = Тип("Булево") Тогда
		Возврат ЗначениеПоУмолчанию;
	ИначеЕсли ТипЗначения = Тип("Число") Тогда
		Возврат ЗначениеПоУмолчанию;
	ИначеЕсли ТипЗначения = Тип("Строка") Тогда
		Возврат ЗначениеПоУмолчанию;
	ИначеЕсли ТипЗначения = Тип("Дата") Тогда
		Возврат ЗначениеПоУмолчанию;
	ИначеЕсли ТипЗначения = Тип("СправочникСсылка.Типы") Тогда
		Возврат ЗначениеПоУмолчанию.Наименование;
	ИначеЕсли ТипЗначения = Тип("СправочникСсылка.Значения") Тогда
		Возврат ЗначениеПоУмолчанию.Владелец.Наименование;
	КонецЕсли;
	Возврат Неопределено;
КонецФункции

Функция ПолучитьИмяЗначенияПоУмолчанию(ЗначениеПоУмолчанию)
	ТипЗначения = ТипЗнч(ЗначениеПоУмолчанию);
	Если ТипЗначения = Тип("СправочникСсылка.Значения") Тогда
		Возврат ЗначениеПоУмолчанию.Наименование;
	КонецЕсли;
	Возврат Неопределено;
КонецФункции
