
Процедура ПередЗаписью(Отказ)
	Если Не ЭтоГруппа Тогда
		ОпределенАлгоритмЗагрузки = Ложь;
		Если ВариантЗагрузки > 0 Тогда
			ОпределенАлгоритмЗагрузки = Истина;
		Иначе
			СтруктураХранения = ХранилищеДереваСериализации.Получить();
			Если ТипЗнч(СтруктураХранения) = Тип("Структура") Тогда
				ДС = Неопределено;
				Если СтруктураХранения.Свойство("ДеревоСериализации", ДС) Тогда
					Если ТипЗнч(ДС) = Тип("ДеревоЗначений") Тогда
						Если ДС.Строки.Количество() > 0 Тогда
							ОпределенАлгоритмЗагрузки = Истина;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
